/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50617
Source Host           : localhost:3306
Source Database       : test

Target Server Type    : MYSQL
Target Server Version : 50617
File Encoding         : 65001

Date: 2016-03-06 15:50:32
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for blog_admin
-- ----------------------------
DROP TABLE IF EXISTS `blog_admin`;
CREATE TABLE `blog_admin` (
  `uid` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(10) NOT NULL DEFAULT '',
  `passwd` char(32) NOT NULL DEFAULT '',
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

-- ----------------------------
-- Records of blog_admin
-- ----------------------------
INSERT INTO `blog_admin` VALUES ('2', 'pikaqiu', '21232f297a57a5a743894a0e4a801fc3');

-- ----------------------------
-- Table structure for blog_article
-- ----------------------------
DROP TABLE IF EXISTS `blog_article`;
CREATE TABLE `blog_article` (
  `aid` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(155) NOT NULL DEFAULT '',
  `time` int(10) unsigned NOT NULL DEFAULT '0',
  `thumb` varchar(200) DEFAULT '',
  `content` text,
  `type` varchar(20) NOT NULL DEFAULT '0',
  PRIMARY KEY (`aid`)
) ENGINE=InnoDB AUTO_INCREMENT=64 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

-- ----------------------------
-- Records of blog_article
-- ----------------------------
INSERT INTO `blog_article` VALUES ('52', '去去去去去去去去去', '1455891026', '14558910258524.jpg', '去去去去去去去去去去去去', 'study');
INSERT INTO `blog_article` VALUES ('53', '去去去去去去去去去', '1455891026', '14558910268694.jpg', '去去去去去去去去去去去去', 'study');
INSERT INTO `blog_article` VALUES ('55', '111', '1456044867', '14560448668254.jpg', '11111111111', 'life');
INSERT INTO `blog_article` VALUES ('56', 'ddddddd', '1456044890', '14560448904482.jpg', '111111111111111111', 'life');
INSERT INTO `blog_article` VALUES ('57', 'qqqq', '1456045028', '14560450283108.jpg', 'qqqqqqqqqq', 'life');
INSERT INTO `blog_article` VALUES ('58', 'aaaaa', '1456045043', '14560450435783.jpg', 'aaaaaaaaaaaaa', 'life');
INSERT INTO `blog_article` VALUES ('59', '1111', '1456045264', '14560452644039.jpg', '1111111111111', 'life');
INSERT INTO `blog_article` VALUES ('60', '毕业季，不想说再见', '1457070287', '14570702866428.jpg', '毕业，对于我们来说就如同成长一样，这个过程总是要经历的，尽管内心有万般的不舍与无奈，但是他确实真真切切的存在着，一旦时间走到那一点，他会毫不犹豫地把我们推出校园，那样决绝，没有丝毫挽留。到那时，无论多么要好，即使每天都黏在一起的我们也终将踏上属于自己的轨道。\r\n\r\n　　依稀记得我们当时带着稚气未脱的脸踏入大学校门，不瞒你们说尽管高中也离家住校，但是我就是这么没出息，一旦走入陌生环境就有恐惧感，对什么也害怕，(呵呵，你们家小蛋蛋就是这样让人操心啊)刚与你们在一起时对你们不了解也不太说话，就任凭你说破天，俺就是不答腔，嘿嘿，我想你们那时肯定心里嘀咕这小孩怎么这么怪呢?现在想想我也觉得当时的自己的确够拧的。\r\n\r\n　　现在让我回想最难忘最幸福的应该算军训那段日子了吧，尽管那时的我们叫嚣如何累如何辛苦，可是重要的是那时的我们最开心。嘴上说着这军训服如何如何难看，穿着又大又肥，完全显现不出身材嘛，可是想想这一生也就穿这一次吧，心里还是挺美的呵呵，我们那时独创了自己的舍歌，尽管我五音不全，到现在也只会哼一句吧(是不是该打嘿嘿)，可是每当听到这首歌(你们都记得吧)就感觉特别温暖，心里有说不出的愉快，然后就在那里偷偷地傻笑~\r\n\r\n　　还有你们也都清楚小蛋蛋老爱臭美，所以总是喊着;给我照张相吧，呵呵，你们总是对我的行为嗤之以鼻，不过到现在我也没改变依然保持“优良传统”，只是没有你们在我耳边“讽刺”我了，还真别说刚开始有些不习惯呢\r\n\r\n　　再就是我总是语出惊人，用你们的话说就是“蛋蛋的经典语录”，一说错话就换来一阵大笑，接着你们轮番“炮击”我，我就假装生气，不和你们一般见识，被你们称作“开心果”其实，我挺开心的，特别是看见你们笑的肆无忌惮，感觉没有一点烦恼我觉得心里挺舒服的\r\n\r\n　　接着我在这里做一下自我检讨呵呵，你们也许觉得分开后没之前和你们亲，你们觉的小蛋蛋变了。我想说的是你们的小蛋蛋一直都在也没有变，(只是有时候会有小孩子气嘿嘿)而且一直记得在一起的点点滴滴，是清清楚楚的记得\r\n\r\n　　就亲们，和你们在一起有太多美好的回忆，我怕我再想我会控制不住情绪，我会珍惜与你们在一起的日子。', 'life');
INSERT INTO `blog_article` VALUES ('61', '涸辙之鱼', '1457070350', '14570703501887.jpg', '中国寓言故事：涸辙之鱼\r\n\r\n　　庄子家已经贫穷到揭不开锅的地步了，无奈之下，只好硬着头皮到监理河道的官吏家去借粮。\r\n\r\n　　监河侯见庄子登门求助，爽快地答应借粮。他说：“可以，待我收到租税后，马上借你300两银子。”\r\n\r\n　　庄子听罢转喜为怒，脸都气得变了色。他忿然地对监河侯说：“我昨天赶路到府上来时，半路突听呼救声。环顾四周不见人影，再观察周围，原来是在干涸的车辙里躺着一条鲫鱼。”\r\n\r\n　　庄子叹了口气接着说：“它见到我，像遇见救星般向我求救。据称，这条鲫鱼原住东海，不幸沦落车辙里，无力自拔，眼看快要干死了。请求路人给点水，救救性命。”\r\n\r\n　　监河侯听了庄周的话后，问他是否给了水救助鲫鱼。\r\n\r\n　　庄子白了监河侯一眼，冷冷地说：“我说可以，等我到南方，劝说吴王和越王，请他们把西江的水引到你这儿来，把你接回东海老家去罢！”\r\n\r\n　　监河侯听傻了眼，对庄子的救助方法感到十分荒唐：“那怎么行呢？”\r\n\r\n　　“是哇，鲫鱼听了我的主意，当即气得睁大了眼，说眼下断了水，没有安身之处，只需几桶水就能解困，你说的所谓引水全是空话大话，不等把水引来，我早就成了鱼市上的干鱼啦！”\r\n', 'emotion');
INSERT INTO `blog_article` VALUES ('62', '玉器和瓦罐', '1457070405', '14570704059480.jpg', '中国寓言故事：玉器和瓦罐\r\n\r\n　　韩昭侯平时说话不大注意，往往在无意间将一些重大的机密事情泄露了出去，使得大臣们周密的计划不能实施。大家对此很伤脑筋，却又不好直言告诉韩昭侯。\r\n\r\n　　有一位叫堂谿（xi）公的聪明人，自告奋勇到韩昭候那里去，对韩昭侯说：“假如这里有一只玉做的酒器，价值千金，它的中间是空的，没有底，它能盛水吗？”韩昭侯说：“不能盛水。”堂豁公又说：“有一只瓦罐子，很不值钱，但它不漏，你看，它能盛酒吗？”韩昭侯说：“可以。”\r\n\r\n　　于是，堂谿公因势利导，接着说：“这就是了。一个瓦罐子，虽然值不了几文钱，非常卑贱，但因为它不漏，却可以用来装酒；而一个玉做的酒器，尽管它十分贵重，但由于它空而无底，因此连水都不能装，更不用说人们会将可口的饮料倒进里面去了。人也是一样，作为一个地位至尊、举止至重的国君，如果经常泄露臣下商讨有关国家的机密的话，那么他就好像一件没有底的玉器。即使是再有才干的人，如果他的机密总是被泄露出去了，那他的计划就无法实施，因此就不能施展他的才干和谋略了。”\r\n\r\n　　一番话说得韩昭侯恍然大悟，他连连点头说道：“你的话真对，你的话真对。”\r\n\r\n　　从此以后，凡是要采取重要措施，大臣们在一起密谋策划的计划、方案，韩昭侯都小心对待，慎之又慎，连晚上睡觉都是独自一人，因为他担心自己在熟睡中说梦话时把计划和策略泄露给别人听见，以至于误了国家大事。\r\n\r\n　　堂谿公开导韩昭侯的故事告诉我们，有智慧的人很善于说话，能从日常生活中的小事引出治国安邦的大道理；能够虚心接受意见、不唯我独尊的人，才是明智的领导者。', 'life');
INSERT INTO `blog_article` VALUES ('63', '猫', '1457189609', '14571896088196.jpg', '昨天看了一本书，名字叫《好小猫》，作者顾湘。\r\n\r\n今天把结尾看完了，突然想起了我曾经养过的几只猫。\r\n\r\n那本书里作者把它们的姿态描写的极为细腻，有时会跟着揪心，有时候会不自觉的舒心一笑。\r\n\r\n我已记不清我为什么那么喜欢猫了，尤其喜欢中长毛的白色小猫。\r\n\r\n记忆中的第一只小猫，全身白色，花了二十块钱在集市上买来的，那时候还不像现在是的哪里都能看到猫的踪影。\r\n\r\n那时候的她极具野性，可是我跟着妈妈去买她的时候，第一眼就喜欢她了。那感觉就像是一见钟情的恋人一样，很神奇。\r\n\r\n我喜欢抱着猫睡觉，有她在我身边，总会很踏实。\r\n\r\n我每年夏天都会逮住她为她捉跳蚤，为此我没少让她那锋利的爪子抓伤。\r\n\r\n可我还是喜欢她。\r\n\r\n她来我家的时候，已经快成年了，所以和她培养感情是吃了不少苦头的。\r\n\r\n后来我让妈妈为她做了一个红色的脖套，就好像为了证明她就是我家的猫一样，觉得她更漂亮了。\r\n\r\n养了三年多吧，她死的那年，是个冬天，应该是快过年了吧。\r\n\r\n我们家对门搬到新房子里住了，所以老房子就一直空着，破旧不堪，没有人愿意买进那个院子一步，尤其是晚上。\r\n\r\n可是我心爱的猫却极爱那个院子，那里面有她的天敌。\r\n\r\n我本来就不喜欢他们家人，猫又是在他们家老院子里吃的老鼠药，因此更不喜欢了。\r\n\r\n那晚我看到那样难过的她，我的心也跟着揪紧了。妈妈说给她打了针，第二天再打一针就会好的，可是第二天，她的眼睛就再也没睁开。我恨了那家人好久。\r\n\r\n还记得有一次，她把我吓着了。\r\n\r\n那时候我们家也还是老房子，对卫生没那么多要求，于是怕他冷，就拿了个小纸箱放在炕头上做她的窝。\r\n\r\n那晚我做了梦，迷迷糊糊听见她在叫，于是就伸手摸摸她，她很享受的舔着嘴巴。\r\n\r\n我在黑暗中摸索，摸到一个东西，湿湿的，猛地一下惊醒，把那个东西扔到了地上，马上拉开灯，才知道那是老鼠头，可以想象那只老鼠的个头有多大。\r\n\r\n过了好久才平复下来，不那么紧张。\r\n\r\n她来我们家的第二年生了第一胎小猫，五只，也许是太年轻了，没什么经验，没多久就都夭折了。\r\n\r\n第三年，生了第二胎，三只，七天以后，又都夭折了，那几只小猫都是叫了个哥哥帮忙把小猫用纸包好了埋在同一个地方。\r\n\r\n她也是，叫哥哥帮忙埋在了那里。我不敢去，只摘了她的脖套留下纪念。\r\n\r\n而如今，已不知道到里去了。\r\n\r\n第二只小猫，来的时候不是很大，不过记得有些模糊了，黑白花，是只公猫。\r\n\r\n他在我的印象里，不是很调皮，我跟他的感情也不是那么深。\r\n\r\n两年多以后，他也死了，死在别人家地里。我也没去看他最后一眼。\r\n\r\n那年是秋天，失踪了好几天，到处找都找不着，以为他玩够了回来的。可惜，再也回不来了。\r\n\r\n人家收完地，已经是几天以后了，我和妈妈路过，远远的看见像他一样的东西，因为离得远，所以不确定。\r\n\r\n妈妈说让我过去看看，我怕是他，所以固执的没有去。\r\n\r\n最后还是哥哥去了，帮他善后。\r\n\r\n第三只小猫，白色，没有一点杂色，她来我家的时候最小，只有十几天大，可是却顽皮的不行，也只有她最馋嘴。\r\n\r\n所以她是做了饱死鬼，妈妈找东西发现她的时候，她已经失踪了好多天了。\r\n\r\n跟我最默契的也是她，我半个月回来一次，我在家呆几天，她就在家呆几天。\r\n\r\n我不在家的时候，她好几天才回去一次，妈妈说告诉我这些的时候，眼睛里似乎有一种嫉妒，虽然我知道不是。\r\n\r\n我很自豪，也很愿意在我重要的人面前炫耀她跟我的亲昵，现在却没了机会。\r\n\r\n好多次央求妈妈再养一只猫，可妈妈说什么也不养了。\r\n\r\n我不在家，也就只好作罢，等有机会了，自己养吧。', 'life');

-- ----------------------------
-- Table structure for blog_datas
-- ----------------------------
DROP TABLE IF EXISTS `blog_datas`;
CREATE TABLE `blog_datas` (
  `did` int(4) NOT NULL,
  `nc` varchar(100) CHARACTER SET utf8 DEFAULT NULL,
  `tx` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `gx` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `xb` varchar(4) DEFAULT NULL,
  `nl` int(8) DEFAULT NULL,
  `yx` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `gxqm` text CHARACTER SET utf8,
  PRIMARY KEY (`did`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- ----------------------------
-- Records of blog_datas
-- ----------------------------
INSERT INTO `blog_datas` VALUES ('1', '从前有座山', '14570746186897.jpg', '中国', 'girl', '1', '163', '山里有座庙');

-- ----------------------------
-- Table structure for blog_message
-- ----------------------------
DROP TABLE IF EXISTS `blog_message`;
CREATE TABLE `blog_message` (
  `mid` int(4) NOT NULL AUTO_INCREMENT,
  `aid` int(4) NOT NULL,
  `comment` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  PRIMARY KEY (`mid`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=latin1;

-- ----------------------------
-- Records of blog_message
-- ----------------------------
INSERT INTO `blog_message` VALUES ('1', '63', '111');
INSERT INTO `blog_message` VALUES ('2', '52', '111');
